package Homeworks.HW1;

public class Task3 {

//    Экстра задача
//
//Вывести/напечатать смайлик (не :), а настоящий смайлик одним символом).
// Чтобы вывести настоящий смайлик в Java, можно использовать символы юникода,
// которые представляют смайлики. Например, смайлик 🙂 (развесёлое лицо) имеет код U+1F642.

    public static void main(String[] args) {

        System.out.println("\uD83D\uDE42");
        System.out.println("\uD83D\uDE00");
        System.out.println("\uD83D\uDE04");

    }

}
