package Homeworks.HW1;

public class Task1 {

    public static void main(String[] args) {
        // Задача №1
        //
        //Написать программу которая будет печатать/выводить следующий текст:
        //
        //3
        //2
        //1
        //Поехали!!!

//        System.out.println("3");
//        System.out.println("2");
//        System.out.println("1");
//        System.out.println("Поехали!!!");

        System.out.println("3/n2/n1/nПоехали!!!");

    }

}
